{"text": "I don't care if I miss 100 shots in a row. I’m never gonna stop shooting the ball. I love it too much and I work too hard."}
{"text": "HOLY CANNOLI this is crazy."}
{"text": "There were some dog days. There was a lot of tears shed on the bench. Steph talked me right, even Draymond, and just leaning on those guys."}
{"text": "I'm on cloud... 109 right now"}
{"text": "Make your supporters proud and your haters jealous"}
{"text": "I knew my worth...I knew I could be one of the best two-guards in the league. I'm not going to be bashful about it anymore."}
{"text": "If you call someone a coward, how are you not going to put your name on that quote?"}
{"text": "I don't care if I miss 100 shots in a row. I'm never gonna stop shooting the ball."}
{"text": "When you're overseas and on a trip for a while, it's tough to stay groomed. You miss your routine."}
{"text": "I know to win a championship, you're not going to do it alone. You're going to have a great supporting cast."}
{"text": "You got two options, it's either fight or flight and I'm fighting all day."}
{"text": "I forgot the internet was so worldwide. It is undefeated."}
{"text": "Y'all should get this on camera, I make the best paper airplane on the West Coast."}
{"text": "I missed you [his shooting hand after sinking a three]."}
{"text": "I usually observe if the piping and stuff is new. Sometimes, you know, if something looks like it’s been there a while, I try to kind of avoid that."}
{"text": "Once we go on a win streak, it will not matter. This will be in the past, like a pony tail."}
{"text": "Look at what pettiness gets you. Gets you 1-8 in the Finals. Idiots."}
{"text": "It’s building. It’s building like a … I don’t know. It’s building really well."}
{"text": "Do everything we did, but opposite."}
{"text": "Oh man, poor guy. Just trying to get some good content, you play stupid games, you get rewarded stupid prizes."}
{"text": "It's obviously a nickname I earned and I want to live up to it, at the same time, I don't want to go in there and play hero ball. I'm just going to be in there and be Klay Thompson, do what I've been doing the last few games. I know that will allow us to be successful."}
{"text": "Well we need him if we want to win this thing, i know Steph is going to do everything he can in his power to play. Really hoping he’s OK because he’s our identity, and without him, it will be very difficult."}
{"text": "Definitely. I think we just need to help Steph in general, he’s been incredible this series. So, we’ll all do our best. I think we’ll respond. I think we’ll come correct tomorrow. And I’m just excited for the opportunity. We still have a chance to even out the series and take home-court advantage."}
{"text": "Klay Thompson and Jordan Poole was magical."}
{"text": "I'm happy with the night, but I want to build on this, i want to shoot the lights out all the time."}
{"text": "Draymond's been special all playoffs, ... When he goes, we go. He was tremendous tonight."}
{"text": "We came in with that mindset to put our foot on the throttle and not let go, we let go in Game 2 and we won't do that the rest of the playoffs. I really believe that."}
{"text": "We let our guard down. We weren't the aggressors anymore. We didnt deserve to win that game."}
{"text": "About seven seconds on the clock he just kept going backward, I don’t know why, but he just threw it up and I didn’t think it had any chance of going in, that was kind of like a dagger shot. It just gave us all the momentum back."}
{"text": "Obviously people have feelings and people's feelings get hurt even if they're called a bad word, i guess his feelings just got hurt. The Warriors ''ve all been called plenty of bad words on the basketball court before. Some guys just react to it differently."}
{"text": "I was trying to shoot until I missed, it was one of those nights where it felt like everything was good."}
{"text": "They showed me the third quarter stat sheet –- to see an NBA record was humbling."}
{"text": "It just feels good to say we're the best team in the world, with the best player in the world."}
{"text": "As a rule, I do not approve of messing around with coffee. No sugar, no milk, no chocolate, hazelnuts, cinnamon, no nothing....Just drink it black, the way God does"}
{"text": "Steve held us to a high standard. He told us he was going to when we first met him at the USA camp. He's been a great leader. I mean, the guy always keeps his composure. He has an amazing mind for the game, and man, Steve, I'm just proud of him. The way he's balanced everybody and let us know what our roles are, he's been great for us. Him and the whole coaching staff. We all deserve this together, we work so hard."}
{"text": "I don't try to attach myself to technology so much. I'm on my phone a lot, though, but in the off season, I try to get away from it as much as I can."}
{"text": "I think I might not be the best vertical athlete, but I think I'm quicker than people give me credit for. That was the biggest knock on me coming out of college."}
{"text": "The cool thing about Snapchat is you can get a lot of news on there now. There's CNN, ESPN, and I find myself reading the most random articles. I don't know how it actually benefits me, but it's interesting. I like to stay up on current events, so I have to give kudos to Snapchat: they've done a good job of that. But I'm on there way too much."}
{"text": "I never tried Pokemon Go. I figured I'd get too addicted to it. I did play Pokemon Snap on Nintendo 64, so that window is closed for me"}
{"text": "I tried to swim as much as possible. Being in Southern California in the summer time, it's so nice because you have the warm beaches, so I try to swim every day."}
{"text": "I'm tired. I want to go eat a sandwich."}
{"text": "I wear what I like and what's comfortable. I probably got that from my dad."}
{"text": "I wouldn't say I've had a shopping mistake, but earlier in my career people made fun of me for the way I dressed. But I can confidently say my style has gotten better over the years."}
{"text": "My mom and [Andre's] wife go shopping together for us...They have good senses of style."}
{"text": "I am happy. I scored 43 points, man...Would you be happy, Kerith?!"}
{"text": "You kinda see what you get...the ball goes in the hoop a lot."}
{"text": "[Magnus Carlsen] said he'd sit down and teach me some [chess things] one day"}
{"text": "I'm an avid collector of robes"}
{"text": "It's my dream to one day be an athletic director of a high school slash high school coach...When I'm done playing, everything I've learned, I just want to give back to the kids who are coming up."}
{"text": "All [Steph and I] do is shoot threes and win championships... I love you brother!"}
{"text": "I played point guard growing up and I played quarterback so vision was always in my repertoire"}
{"text": "Sea captain"}
{"text": "I choose business ethics"}
{"text": "This thing (bike) is light as a feather too, that's nice"}
{"text": "Steph, what's going on man? I haven't seen you in a while"}
{"text": "Don't know a damn thing but I'm teaching him the ropes"}
{"text": "Most importantly, congratulations Mrs. Principessa--I love seeing those engagements here, always special"}
{"text": "How did it feel? I've been in that position before, to take the ball off the head in the first quarter from Draymond?"}
{"text": "I've felt the same pain and I just want to hear it from your mouth how that felt"}
{"text": "Back to you, Bobby!"}
{"text": "Dialed in, baby, having fun out here!"}
{"text": "I don't know if I was born for it, but I definitely worked my butt off to get to this point...I mean I guess you could say I was born for it."}
{"text": "New Orleans? I might go see the swamps or something. Try to catch an alligator? I don't know."}
{"text": "I'm still hot"}
{"text": "I'm still hungry to be great"}
{"text": "I guess his feelings just got hurt."}
{"text": "Guys talk trash in this league all the time...I'm just kinda shocked some guys take it so personal."}
{"text": "It pissed me off so much. I can't wait to retweet that thing. Freakin' bum"}
{"text":"Twitter fingers. I got a memory like an elephant. I don't forget." }
{"text":"Strength in numbers...my bad"}
{"text":"I didn't realize how much you use your ankle until I hurt it"}
{"text":"Go cougs"}
{"text":"But we got some tattle tales on this team, I guess"}
{"text": "I pulled up and surprised some ballers with @bwwingsburgers and @starry last week. Grateful to give back to the Bay and have some fun."}
{"text": "Checkmate Rocco!"}
{"text": "HEAT. CHECK. TIME."}
{"text": "We’re gonna need a bigger sushi boat."}
{"text": "I forget, did I say crabcakes?"}
{"text": "Two injuries and 941 days out of the game showed me the resilience I never knew I had."}
{"text": "Proud vet is an understatement . I’ve seen this man put in the work everyday for the last few years and his future is incredibly bright"}
{"text": "1, 2, 3 ,4 rings in my bank account, bitch"}
{"text": "Anyone who is an expert on TV on a sport but never played the damn thing, you can't trust them. You can't trust their opinion, you can't trust their opinion. They said we were dead in the water and what did we do? Win a championship. So how does it feel? I know it hurt them, I know it hurt them bad"}
{"text": "JK get off my live!...Kuminga get in the gym."}
{"text": "I can watch Gary Payton II play defense all night long"}
{"text": "I spit hot fire."}
{"text": "That’s funny dad one of your better tweets"}
{"text": "Sheeeesh @StephenCurry30 !! Welcome to the club big bro #62"}
{"text": "A beautiful package from Nerf, this is great, this is phenomenal. We got a little letter too!"}
{"text": "Everyday, we make around 35,000 choices. Your signature look. The music you listen to. What part of your game will you improve?"}
{"text": "What works for me? I read the newspaper"}
{"text": "They didn’t want ya Jonas."}
{"text": "Happy Chinese New Year from Me & Rocco!"}
{"text": "I'm just happy to be there man, it's an honor to be an all-star"}
{"text": "Let's Do This!"}
{"text": "Happy New Year from me and Rocco"}
{"text": "Can't stop, won't stop"}
{"text": "Rocco has been waiting by the tree all day!"}
{"text": "We pride ourselves, especially on our team, about being active members of the community"}
{"text": "Great W, keep it going"}
{"text": "Just wanted to say thank you to all the firefighters and first responders working so hard to put this fire out."}
{"text": "That was my sinker"}
{"text": "let joc and roc live!!"}
{"text": "Dubs win and the cougs win couldn't ask for a better night"}
{"text": "Great day to be a warrior"}
{"text": "I would pay a lot of money for an original ABA ball"}
{"text": "The better team came to play today sorry bro"}
{"text": "I hate to admit it but Trayce might be the best overall athlete in the fam lol"}
{"text": "Mick fanning a beast for that"}
{"text": "Congrats bro bring the ship back to the Cruz!!"}
{"text": "Playoff basketball at oracle life doesn't get much better. Lets get it DubNation!"}
{"text": "Final tune up gotta finish strong"}
{"text": "Happy Easter!! Enjoy it with u fam & loved ones and Thank the one above for LIfe!!"}
{"text":"That's deep"}
{"text": "Not that mad tho bracket still solid"}
{"text": "craziest first day of the tourney I've ever seen"}
{"text": "Thanks Samsung soho for having me today"}
{"text": "The Slap"}
{"text": "Man...what a night. Gotta give credit to my teammates most unselfish group I ever played with. God is good!"}
{"text": "A kickers dream come true right there"}
{"text": "Big bro balled out tonight"}
{"text": "Gotta take advantage of this home stand and finish it out strong tonight! "}
{"text": "Preach Milton!"}
{"text": "It doesn't matter who we're up against oracle is always gonna be rockin' and we're extremely thankful for that. "}
{"text": "year 2000 was 15 years ago? Sheesh"}
{"text": "For the 1st time in my 4 years in the bay I get to watch my cougs play this weekend "}
{"text": "Most powerful movie I've seen in a long time a must watch for everyone"}
{"text": "Too cold in the bay right now"}
{"text": "On my off day really!!?"}
{"text": "Great road trip haven't been this excited to get back to the bay in a long time!"}
{"text": "Wish I could be in Pullman for apple cup weekend "}
{"text": "Wilson the new air McNair"}
{"text": "Moe buckets"}
{"text": "Love the game baby"}
{"text": "Yea Gavin"}
{"text": "Both my fantasy teams strugglin"}
{"text": "Biiiiig at bat"}
{"text": "Annabelle was crazy"}
{"text": "We live in the generation of media overstimulation"}
{"text": "Rosenthal throwin "}
{"text": "Pch cruisin"}
{"text": "Ur a strong individual if u don't eat ur chick fa let on the ride home"}
{"text": "Handing out FIFA fades all day"}
{"text": "Duck huntin time lets go Cougs!"}
{"text": "Rocco's gonna freak out"}
{"text": "Ladera's never felt so good"}
{"text": "About to see what trayce's golf game is lookin like"}
{"text": "We did this for our country and PG"}
{"text": "Excited to see Madrid today"}
{"text": "Is Diablo 3 nice? Idk if anything can top Diablo 2 tho that game was the goat"}
{"text": "We have a special opportunity tonight to honor those who perished on that tragic unforgettable day 13 years ago by playing as hard as we can"}
{"text": "Gobert is ballin out"}
{"text":"Snapchats of the club are the weakest"}
{"text": "Worst part of fantasy football is when someone on ur bench balls out and that 20 points is useless"}
{"text": "They need to make a biopic of Jack Johnson (the boxer) can't imagine what he heard and went thru"}
{"text": "yea titans"}
{"text": "If you don't like this song you probably don't have a soul Lol"}
{"text": "Real recognize real thats familiar"}
{"text": "Up at 5 30 am in Bilbao for my fantasy draft "}